1.(1) 3개(7,17,70)
1.(2) 16개 (2^4 = 16개)
1.(3) 1개 (전체 노드 수 : 2^5-1 = 31, 리프 노드 수 : 2^4 =16개, 내부 노드 수 : 31-16 = 15개)
1.(4) 항상 성립한다. 

2.(1) n/2개
2.(2) 리프 노드 수가 아닌 것이 내부 노드이다. 리프 노드 수 = 내부 노드 수 +1(n이 홀수일 때), 리프 노드 수 = 내부 노드 수(n이 짝수일 떄)

3.(1) 5-3-1-8-7-6-9
3.(2) 1-3-5-6-7-8-9
3.(3) 1-3-6-7-9-8-5
3.(4)
베이스 케이스 : h=1.(h:height)
               T는 단 한 개의 노드(루트)를 갖는다.
               유일한 노드를 방문하는 것은 당연히 정렬된 순서다.

귀납적 가정 : k < h인 모든 k에 대해 성립한다 가정하자.

귀납적 전개 : (정리가 k=h에 대해 성립함을 보인다)
             이진 검색 트리 T는 아래와 같이 그릴 수 있다.
             귀납적 가정에 의해 중위 순회는 TL과 TR을 각각 정렬된 순서로 방문한다.
             TL의 모든 키는 r의 키보다 작고, TR의 모든 키는 r의 키보다 크므로, 중위 순ㄴ회 TL -> r -> TR는 정렬된 순서이다.


4. 1. 루트 55 방문 -> 30<55이므로 왼쪽으로
   2. 15 방문 -> 30>15이므로 오른쪽으로
   3. 28방문 -> 30>28이므로 오른쪽으로
   4. 30방문 -> 30 == 30 => 검색 완료


5.         55
          /  \
        15    60
       /  \     \
      8   28    90
     /   /  \
    3   18  30
       /      \
      16       48               



6.         55
          /  \
        15    60
       /  \     \
      8   28    90
     /      \
    3        48
            /  \
           33   50
          /  \
         32  36



7.         55
          /  \
        15    60
       /  \     \
      8   28    90
           \
           48
          /  \
         38   50
        /
       33
      /  \
     32  36



8.         55
          /  \
        28    60
       /  \     \
      8   48    90
     /   /  \
    3   38   50
       /
      33
     /  \
    32  36


9. 최대 : n, 최소 : log(n)
